In [1]:
import numpy as np
import pandas as pd
cities = ('Paris', 'Berlin', 'Vienna', 'London', 'Madrid')
months = ('Jan', 'Apr', 'Jul', 'Oct')
index = pd.MultiIndex.from_tuples([(city, month) for city in cities for month in months])
index

MultiIndex([( 'Paris', 'Jan'),
            ( 'Paris', 'Apr'),
            ( 'Paris', 'Jul'),
            ( 'Paris', 'Oct'),
            ('Berlin', 'Jan'),
            ('Berlin', 'Apr'),
            ('Berlin', 'Jul'),
            ('Berlin', 'Oct'),
            ('Vienna', 'Jan'),
            ('Vienna', 'Apr'),
            ('Vienna', 'Jul'),
            ('Vienna', 'Oct'),
            ('London', 'Jan'),
            ('London', 'Apr'),
            ('London', 'Jul'),
            ('London', 'Oct'),
            ('Madrid', 'Jan'),
            ('Madrid', 'Apr'),
            ('Madrid', 'Jul'),
            ('Madrid', 'Oct')],
           )

In [3]:
index = pd.MultiIndex.from_product((cities, months))
index

MultiIndex([( 'Paris', 'Jan'),
            ( 'Paris', 'Apr'),
            ( 'Paris', 'Jul'),
            ( 'Paris', 'Oct'),
            ('Berlin', 'Jan'),
            ('Berlin', 'Apr'),
            ('Berlin', 'Jul'),
            ('Berlin', 'Oct'),
            ('Vienna', 'Jan'),
            ('Vienna', 'Apr'),
            ('Vienna', 'Jul'),
            ('Vienna', 'Oct'),
            ('London', 'Jan'),
            ('London', 'Apr'),
            ('London', 'Jul'),
            ('London', 'Oct'),
            ('Madrid', 'Jan'),
            ('Madrid', 'Apr'),
            ('Madrid', 'Jul'),
            ('Madrid', 'Oct')],
           )

In [4]:
index.names = ['cities', 'months']
index

MultiIndex([( 'Paris', 'Jan'),
            ( 'Paris', 'Apr'),
            ( 'Paris', 'Jul'),
            ( 'Paris', 'Oct'),
            ('Berlin', 'Jan'),
            ('Berlin', 'Apr'),
            ('Berlin', 'Jul'),
            ('Berlin', 'Oct'),
            ('Vienna', 'Jan'),
            ('Vienna', 'Apr'),
            ('Vienna', 'Jul'),
            ('Vienna', 'Oct'),
            ('London', 'Jan'),
            ('London', 'Apr'),
            ('London', 'Jul'),
            ('London', 'Oct'),
            ('Madrid', 'Jan'),
            ('Madrid', 'Apr'),
            ('Madrid', 'Jul'),
            ('Madrid', 'Oct')],
           names=['cities', 'months'])

In [5]:
# Mean monthly temperature (degC) for each city in each of Jan, Apr, Jul,
temps = [[4.9, 11.5, 20.5, 13.0], [0.1, 9.0, 19.1, 9.4], [0.3, 10.7, 20.8, 10.2], [5.2, 9.9, 18.7, 12.0],[6.3, 12.9, 25.6, 15.1]]

In [6]:
# Mean monthly rainfall (mm) for each city in each of Jan, Apr, Jul,
rainfall = [[51.0, 51.8, 62.3, 61.5], [37.2, 33.7, 52.5, 32.2], [38., 45., 70., 38.], [55.2, 43.7, 44.5, 68.5], [33., 45., 12., 60.]]

In [12]:
arr = np.array((temps , rainfall)).reshape(2,20).T
arr

array([[ 4.9, 51. ],
       [11.5, 51.8],
       [20.5, 62.3],
       [13. , 61.5],
       [ 0.1, 37.2],
       [ 9. , 33.7],
       [19.1, 52.5],
       [ 9.4, 32.2],
       [ 0.3, 38. ],
       [10.7, 45. ],
       [20.8, 70. ],
       [10.2, 38. ],
       [ 5.2, 55.2],
       [ 9.9, 43.7],
       [18.7, 44.5],
       [12. , 68.5],
       [ 6.3, 33. ],
       [12.9, 45. ],
       [25.6, 12. ],
       [15.1, 60. ]])

In [15]:
df = pd.DataFrame(arr, index=index, columns=['Mean temperature /degC','Mean rainfall /mm'])
df

               Mean temperature /degC  Mean rainfall /mm
cities months
Paris  Jan                        4.9               51.0
       Apr                       11.5               51.8
       Jul                       20.5               62.3
       Oct                       13.0               61.5
Berlin Jan                        0.1               37.2
       Apr                        9.0               33.7
       Jul                       19.1               52.5
       Oct                        9.4               32.2
Vienna Jan                        0.3               38.0
       Apr                       10.7               45.0
       Jul                       20.8               70.0
       Oct                       10.2               38.0
London Jan                        5.2               55.2
       Apr                        9.9               43.7
       Jul                       18.7               44.5
       Oct                       12.0               68.5
Madrid Jan                        6.3               33.0
       Apr                       12.9               45.0
       Jul                       25.6               12.0
       Oct                       15.1               60.0

In [16]:
df.loc['Vienna']

        Mean temperature /degC  Mean rainfall /mm
months
Jan                        0.3               38.0
Apr                       10.7               45.0
Jul                       20.8               70.0
Oct                       10.2               38.0

In [22]:
df.loc[('Paris', 'Jul')]

Mean temperature /degC    20.5
Mean rainfall /mm         62.3
Name: (Paris, Jul), dtype: float64

In [23]:
df.loc[('Paris', 'Jul'), 'Mean rainfall /mm']

62.3

In [25]:
df.sort_index(inplace=True)
df['Berlin':'London' ]

               Mean temperature /degC  Mean rainfall /mm
cities months
Berlin Apr                        9.0               33.7
       Jan                        0.1               37.2
       Jul                       19.1               52.5
       Oct                        9.4               32.2
London Apr                        9.9               43.7
       Jan                        5.2               55.2
       Jul                       18.7               44.5
       Oct                       12.0               68.5

In [27]:
df2 = df.rename({'Jan': 1, 'Apr': 4, 'Jul': 7, 'Oct': 10})
df2.sort_index(inplace=True)
df2.loc['Vienna', 'Mean temperature /degC']

months
1      0.3
4     10.7
7     20.8
10    10.2
Name: Mean temperature /degC, dtype: float64

In [28]:
df.xs('Jan', level=1)

        Mean temperature /degC  Mean rainfall /mm
cities
Berlin                     0.1               37.2
London                     5.2               55.2
Madrid                     6.3               33.0
Paris                      4.9               51.0
Vienna                     0.3               38.0

In [30]:
df.unstack()

       Mean temperature /degC                  Mean rainfall /mm              \
months                    Apr  Jan   Jul   Oct               Apr   Jan   Jul
cities
Berlin                    9.0  0.1  19.1   9.4              33.7  37.2  52.5
London                    9.9  5.2  18.7  12.0              43.7  55.2  44.5
Madrid                   12.9  6.3  25.6  15.1              45.0  33.0  12.0
Paris                    11.5  4.9  20.5  13.0              51.8  51.0  62.3
Vienna                   10.7  0.3  20.8  10.2              45.0  38.0  70.0


months   Oct
cities
Berlin  32.2
London  68.5
Madrid  60.0
Paris   61.5
Vienna  38.0